artillery copy.yml
config:
  target: 'https://tillsynsportalentest.naturvardsverket.se/login'
  phases:
    - duration: 30
      arrivalRate: 1
      name: warmup phase
    - duration: 30
      arrivalRate: 1
      rampTo: 3
      name: ramp up to 10
    - duration: 30
      arrivalRate: 1
      rampTo: 4
      name: peak state 

  engines:
    playwright: { aggregateByName: true }
  processor: "./tests/artillery/artillery.js"
  
scenarios:
  - name: "LASTTESTER"
    engine: playwright
    testFunction: "testArtillery"