artillery.yml
config:
  target: 'https://tillsynsportalentest.naturvardsverket.se'
  metrics:
    histograms:
      - name: loginTime
        buckets: [100, 300, 500, 1000, 2000, 5000]
      - name: MFAVerifyTime
        buckets: [50, 100, 200, 500, 1000]
      - name: 08_LoggaUt
        buckets: [50, 100, 200, 500, 1000]
      - name: omraden
        buckets: [50, 100, 200, 500, 1000]
      - name: avfallstyper
        buckets: [50, 100, 200, 500, 1000]
      - name: behandlingsmetoder
        buckets: [50, 100, 200, 500, 1000]
      - name: underkoder
        buckets: [50, 100, 200, 500, 1000]
      - name: B04_sokOrgNummer
        buckets: [50, 100, 200, 500, 1000]
      - name: B05_VisaRapport
        buckets: [50, 100, 200, 500, 1000]
      - name: B06_SokKopplingarVerksamhet
        buckets: [50, 100, 200, 500, 1000]
      - name: B07_SokBehandlingsResultat
        buckets: [50, 100, 200, 500, 1000]
      - name: A_04ÖppenSökning
        buckets: [50, 100, 200, 500, 1000]
      - name: A05_LaddaNedEXCEL
        buckets: [50, 100, 200, 500, 1000]
      - name: A06_MinaNedladdningar
        buckets: [50, 100, 200, 500, 1000]
      - name: A07_StatusLaddaNedKnapp
        buckets: [50, 100, 200, 500, 1000]
      - name: sokOrg.duration
        buckets: [1000, 2000, 5000, 10000]
      - name: sokKopplingar.duration
        buckets: [1000, 2000, 5000, 10000]
      - name: behandRES.duration
        buckets: [1000, 2000, 5000, 10000]
      - name: loggaUt.duration
        buckets: [100, 200, 500, 1000]
  engines:
    playwright:
      aggregateByName: true
  plugins:
    metrics-by-endpoint: {}
  processor: "./tests/artillery/artillery.js"
  includeFiles:
    - "tests/utils/csvReader.js"
    - "tests/utils/randomOmBud.js"
    - "tests/utils/randomOrg.js"
    - "tests/fixtures/data.csv"
    - "tests/fixtures/ombud.csv"
    - "tests/fixtures/organisationsNummer.csv"
  phases:
    - name: "Warmup"
      duration: 30
      arrivalCount: 1
      scenario: "Open-search"
    - name: "Open-search phase"
      duration: 60
      arrivalCount: 10
      scenario: "Open-search"
    - name: "sok-Org-Kop-flow phase"
      duration: 60
      arrivalCount: 5
      scenario: "sok-Org-Kop-flow"

scenarios:
  - name: "Open-search"
    engine: playwright
    testFunction: "testArtillery"
  - name: "sok-Org-Kop-flow"
    engine: playwright
    testFunction: "testArtillery"