artillery.yml
config:
  target: 'https://tillsynsportalentest.naturvardsverket.se/login'
  phases:
    - name: "login phase"
      duration: 30
      arrivalCount: 1
      scenario: "login-search"

    - name: "full-load phase"
      duration: 30
      arrivalCount: 1
      scenario: "full-load-flow"

  plugins:
    metrics-by-endpoint: {}
  engines:
    playwright:
      aggregateByName: true
  processor: "./tests/artillery/artillery.js"
  includeFiles:
    - "tests/utils/csvReader.js"
    - "tests/utils/randomOmBud.js"
    - "tests/utils/randomOrg.js"
    - "tests/fixtures/data.csv"
    - "tests/fixtures/ombud.csv"
    - "tests/fixtures/organisationsNummer.csv"

scenarios:
  - name: "login-search"
    engine: playwright
    testFunction: "testArtillery"

  - name: "full-load-flow"
    engine: playwright
    testFunction: "testArtillery"