artillery.yml
config:
  target: 'https://tillsynsportalentest.naturvardsverket.se/login'
  engines:
    playwright: {}
  processor: "./tests/artillery/artillery.js"
  plugins:
    cloud: {}

scenarios:
  - name: "LASTTESTER"
    engine: playwright
    testFunction: "testArtillery"

phases:
  - duration: 30
    arrivalRate: 10