artillery.yml
config:
  target: 'https://tillsynsportalentest.naturvardsverket.se/login'
  phases:
    - duration: 30
      arrivalCount: 1
      maxVusers: 2
      name: warmup phase
  plugins:
    ensure: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.99: 500
      - http.response_time.95: 500

  engines:
    playwright: { aggregateByName: true }
  processor: "./tests/artillery/artillery.js"
  
scenarios:
  - name: "LASTTESTER"
    engine: playwright 
    testFunction: "testArtillery"