artillery.yml
config:
  target: 'https://tillsynsportalentest.naturvardsverket.se/login'
  engines:
    playwright: {}
  processor: "./tests/artillery/artillery.js"
  plugins:
    cloud: {}

scenarios:
  - name: "LASTTESTER"
    engine: playwright
    testFunction: "testArtillery"

phases:
  - duration: 60       # 🕒 testet pågår i 60 sekunder
    arrivalRate: 1     # 👥 starta 5 nya användare per sekund
    rampTo: 10         # 📈 öka till 20 användare per sekund över tiden