artillery.yml
config:
  target: 'https://tillsynsportalentest.naturvardsverket.se/login'
  phases:
    - name: "Open-search phase"
      duration: 1
      arrivalCount: 100
      scenarioName: "Open-search"
    - name: "sok-Org-Kop-flow phase"
      duration: 1
      arrivalCount: 100
      scenarioName: "sok-Org-Kop-flow"
  plugins:
    metrics-by-endpoint: {}
  engines:
    playwright:
      aggregateByName: true
  processor: "./tests/artillery/artillery.js"
  includeFiles:
    - "tests/utils/csvReader.js"
    - "tests/utils/randomOmBud.js"
    - "tests/utils/randomOrg.js"
    - "tests/fixtures/data.csv"
    - "tests/fixtures/ombud.csv"
    - "tests/fixtures/organisationsNummer.csv"

scenarios:
  - name: "Open-search"
    engine: playwright
    testFunction: "testArtillery"

  - name: "sok-Org-Kop-flow"
    engine: playwright
    testFunction: "testArtillery"