artillery.yml
---
config:
  target: 'https://tillsynsportalentest.naturvardsverket.se/login'
  phases:
    - name: "single user 1min"
      duration: 60
      arrivalCount: 1
  plugins:
    metrics-by-endpoint: {}
    # Du kan lägga till fler Artillery-plugins här om du vill (t.ex. summary, csv- eller influx-export)
  engines:
    playwright:
      aggregateByName: true
  processor: "./tests/artillery/artillery.js"

scenarios:
  # Scenario 1: bara login + sökning + logout
  - name: "login-search"
    engine: playwright
    testFunction: "testArtillery"

  # Scenario 2: full-flödet med org-sökning, kopplingar, behandling osv.
  - name: "full-load-flow"
    engine: playwright
    testFunction: "testArtillery"