artilleryDev copy.yml
config:
  target: 'https://tillsynsportalentest.naturvardsverket.se'
  engines:
    playwright:
      aggregateByName: true
  processor: "./tests/artillery/artillery.js"
  plugins:
    metrics-by-endpoint: {}
  includeFiles:
    - "tests/utils/csvReader.js"
    - "tests/utils/randomOmBud.js"
    - "tests/utils/randomOrg.js"
    - "tests/fixtures/data.csv"
    - "tests/fixtures/ombud.csv"
    - "tests/fixtures/organisationsNummer.csv"

  phases:
  # Warm-up: börja med 2 användare under 2 min
  - duration: 2m
    arrivalCount: 2
    name: Warm-up – 2 användare på 2 min

  # Load-test: öka till 10 användare över 3 min
  - duration: 3m
    arrivalCount: 8
    name: Ramp-up – 8 till, totalt 10 användare

  # Stabil fas: 10 användare kör i loop i 30 min
  - duration: 20m
    arrivalCount: 0
    name: Load steady – VU fortsätter i 30 min


      
      
scenarios:
  - name: "Open-search"
    engine: playwright
    testFunction: "testArtillery" 
    weight: 2
  - name: "Verksamhet_Kopplingar_BehandlingsResultat"
    engine: playwright
    testFunction: "testArtillery"
    weight: 1