artilleryDev copy.yml
config:
  target: 'https://tillsynsportalentest.naturvardsverket.se'
  engines:
    playwright:
      aggregateByName: true
  processor: "./tests/artillery/artillery.js"
  plugins:
    metrics-by-endpoint: {}
  includeFiles:
    - "tests/utils/csvReader.js"
    - "tests/utils/randomOmBud.js"
    - "tests/utils/randomOrg.js"
    - "tests/fixtures/data.csv"
    - "tests/fixtures/ombud.csv"
    - "tests/fixtures/organisationsNummer.csv"

  phases:
    - duration: 1m
      arrivalRate: 20
      rampTo: 2
      name: ramp-up
    - duration: 5m
      arrivalRate: 30
      rampTo: 5
      name: Load Phase
      
      
scenarios:
  - name: "Open-search"
    engine: playwright
    testFunction: "testArtillery" 
    weight: 2
  - name: "Verksamhet_Kopplingar_BehandlingsResultat"
    engine: playwright
    testFunction: "testArtillery"
    weight: 1