artilleryDev.yml
config:
  target: 'https://tillsynsportalentest.naturvardsverket.se'
  engines:
    playwright:
      aggregateByName: true
  processor: "./tests/artillery/artillery.js"
  plugins:
    metrics-by-endpoint: {}
  includeFiles:
    - "tests/utils/csvReader.js"
    - "tests/utils/randomOmBud.js"
    - "tests/utils/randomOrg.js"
    - "tests/fixtures/data.csv"
    - "tests/fixtures/ombud.csv"
    - "tests/fixtures/organisationsNummer.csv"

  phases:
  # Warm-up: börja med 5 användare under 2 min
  - duration: 2m
    arrivalCount: 5
    name: Warm-up – 5 användare på 2 min

  # Load-test: öka till 100 användare över 10 min
  - duration: 10m
    arrivalCount: 95
    name: Ramp-up – till, totalt 100 användare

  # Stabil fas: 100 användare kör i loop i 30 min
  - duration: 5m
    arrivalCount: 0
    name: Load steady – VU fortsätter i 5 min

      
      
scenarios:
  - name: "Open-search"
    engine: playwright
    testFunction: "testArtillery" 
    weight: 70
  - name: "Verksamhet_Kopplingar_BehandlingsResultat"
    engine: playwright
    testFunction: "testArtillery"
    weight: 30