artilleryDev.yml
config:
  target: 'https://tillsynsportalentest.naturvardsverket.se'
  engines:
    playwright:
      aggregateByName: true
  processor: "./tests/artillery/artillery.js"
  plugins:
    metrics-by-endpoint: {}
  includeFiles:
    - "tests/utils/csvReader.js"
    - "tests/utils/randomOmBud.js"
    - "tests/utils/randomOrg.js"
    - "tests/fixtures/data.csv"
    - "tests/fixtures/ombud.csv"
    - "tests/fixtures/organisationsNummer.csv"

  metrics:
    histograms:
      - name: 02_LoginStep2
        buckets: [50, 100, 200, 500, 1000, 2000]
      - name: A01_NavigeraTillSök
        buckets: [100, 300, 600, 1000, 2000]
      - name: A02_HämtaReferensdata
        buckets: [100, 300, 600, 1000, 2000]
      - name: A03_SökningAvancerad
        buckets: [100, 300, 600, 1000, 2000]
      - name: A05_LaddaNedExcel
        buckets: [200, 500, 1000, 2000, 3000]
      - name: A06_MinaNedladdningar
        buckets: [200, 500, 1000, 2000, 3000]
      - name: A07_StatusLaddaNerKnapp
        buckets: [500, 1000, 2000, 5000, 10000]
      - name: iteration.Open-search
        buckets: [100, 300, 600, 1000, 2000]
      - name: B01_NavigeraTillSökVerksamhet
        buckets: [100, 300, 600, 1000, 2000]
      - name: B02_HämtaReferensdata
        buckets: [100, 300, 600, 1000, 2000]
      - name: B04_SökOrgnummer
        buckets: [100, 300, 600, 1000, 2000]
      - name: B05_VisaRapport
        buckets: [200, 500, 1000, 2000, 3000]
      - name: B06_SokKopplingarVerksamhet
        buckets: [100, 300, 600, 1000, 2000]
      - name: B07_SokBehandlingsResultat
        buckets: [100, 300, 600, 1000, 2000]
      - name: 08_LoggaUt
        buckets: [50, 100, 200, 500, 1000]
      - name: iteration.Verksamhet_Kopplingar_BehandllingsResultat
        buckets: [100, 300, 600, 1000, 2000]

phases:
  - name: "Ramp-up parallella tester"
    duration: 150
    arrivalRate: 1
    rampTo: 5

scenarios:
  - name: "Open-search"
    engine: playwright
    testFunction: "testArtillery"
    weight: 1
  - name: "Verksamhet_Kopplingar_BehandllingsResultat"
    engine: playwright
    testFunction: "testArtillery"
    weight: 1